app/controllers/songs_controller.rb

	def create
		@song = Song.create!(songs_params)
---
INSERT INTO "songs" ("title", "singer", "writer", "release_date", "genere", "length", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def update
	    @song = Song.find(params[:id])
	    if @song.update_attributes(songs_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "songs" SET "title" = ?, "writer" = ?, "release_date" = ?, "genere" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["title", "Mine"], ["writer", "Taylor Swift"], ["release_date", "January, 2014"], ["genere", "Country"], ["updated_at", "2015-08-26 23:41:41.161096"], ["id", 3]]

	def destroy
        @song = Song.find(params[:id])
        @song.destroy
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 5]]